samples/get-all-request.xml

<?xml version="1.0" encoding="UTF-8" ?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <GetAllCourseDetailRequest
                xmlns="http://ashimjk.com/courses"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xsi:schemaLocation="http://ashimjk.com/courses course-detail.xsd"
        >
        </GetAllCourseDetailRequest>
    </Body>
</Envelope>